In [ ]:
#SQL is a domain specific language used to query and manage data and works by allowing users to query,insert,delete and update records in databases.

In [ ]:
#NOSQL is a type of database that uses non relational data structures, such as documents,graph databases and keyvalue stores to store and retrieve data.

In [ ]:
#SQL is suitable for structured data with predefined schema.

In [ ]:
#while Nosql is suitable for unstructured and semi structured data.

In [ ]:
#SQL requires vertical scaling to handle large volumes of data.

In [ ]:
#in nosql horizontal scaling is possible to handle large volumes of data.

In [ ]:
#examples of SQL are mysql,postgreSQL,Oracle,SQL Server,Microsoft Sql server etc

In [ ]:
#examples of nosql are Mongodb,cassandra,couchbase,amazondynamodb,redis etc.

In [ ]:
#Sql uses normalised data structure.

In [ ]:
#Nosql uses denormalised data structure.

In [1]:
import pandas as pd
import sqlite3

In [2]:
df=pd.DataFrame({'vehicle':['Maruti','Hayate','Yamaha'],'SPEED':['180','130','150'],'PRICE':['3 LAKH','1 LAKH','90 THOUSAND']})
df

  vehicle SPEED        PRICE
0  Maruti   180       3 LAKH
1  Hayate   130       1 LAKH
2  Yamaha   150  90 THOUSAND

In [3]:
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
df.to_sql('people',cnn)

3

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///jupyter_sql_tutorial.db

In [7]:
%%sql 
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Maruti', '180', '3 LAKH'),
 (1, 'Hayate', '130', '1 LAKH'),
 (2, 'Yamaha', '150', '90 THOUSAND')]

In [ ]:
#so in the above we have created sql data and also connection with sqlite3 which we can see above.